
<details><summary>Show Format output</summary>

```terraform

provider.tf
::error::Terraform exited with code 3.
```

</details>

<details><summary>Show Init output</summary>

```terraform

[0m[1mInitializing HCP Terraform...[0m
[0m[1mInitializing provider plugins...[0m
- Finding latest version of hashicorp/aws...
- Installing hashicorp/aws v5.81.0...
- Installed hashicorp/aws v5.81.0 (signed by HashiCorp)
Terraform has created a lock file [1m.terraform.lock.hcl[0m to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.[0m

[0m[1m[32mHCP Terraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with HCP Terraform. Try running "terraform plan" to
see any changes that are required for your infrastructure.

If you ever set or change modules or Terraform Settings, run "terraform init"
again to reinitialize your working directory.[0m
```

</details>

<details><summary>Show Validate output</summary>

```terraform

Success! The configuration is valid.
```

</details>

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/postech-fiap-alura/totem-express/runs/run-XEJ6YBJ7tKqDMVh4

Waiting for the plan to start...

Terraform v1.10.0
on linux_amd64
Initializing plugins and modules...
data.aws_iam_role.labrole: Refreshing...
aws_subnet.totem_express_db_subnet[0]: Refreshing state... [id=subnet-050eb2566d2327142]
aws_subnet.totem_express_db_subnet[1]: Refreshing state... [id=subnet-0f1e5f837057ce915]
data.aws_availability_zones.available: Refreshing...
aws_security_group.db_sg: Refreshing state... [id=sg-03f7e989bbf6d7e3a]
aws_db_subnet_group.default: Refreshing state... [id=totex-express-db-subnet-group]
aws_vpc.totem_express_db_vpc: Refreshing state... [id=vpc-0bf01b4692d2af782]
aws_db_instance.default: Refreshing state... [id=db-4Q57G7WFXBOB22AEVKRPC7NPOU]
data.aws_iam_role.labrole: Refresh complete after 0s [id=LabRole]
data.aws_availability_zones.available: Refresh complete after 0s [id=us-east-1]
aws_db_instance.default: Drift detected (delete)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_db_subnet_group.default will be destroyed
  - resource "aws_db_subnet_group" "default" {
      - arn                     = "arn:aws:rds:us-east-1:992382713563:subgrp:totex-express-db-subnet-group" -> null
      - description             = "Managed by Terraform" -> null
      - id                      = "totex-express-db-subnet-group" -> null
      - name                    = "totex-express-db-subnet-group" -> null
      - subnet_ids              = [
          - "subnet-050eb2566d2327142",
          - "subnet-0f1e5f837057ce915",
        ] -> null
      - supported_network_types = [
          - "IPV4",
        ] -> null
      - tags                    = {
          - "Name" = "totex-express-db-subnet-group"
        } -> null
      - tags_all                = {
          - "Name" = "totex-express-db-subnet-group"
        } -> null
      - vpc_id                  = "vpc-0bf01b4692d2af782" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_ecr_repository.repository will be created
  + resource "aws_ecr_repository" "repository" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "totem_express"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)
    }

  # aws_eks_access_entry.access-entry will be created
  + resource "aws_eks_access_entry" "access-entry" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "totem_express-8soat"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = [
          + "8soat",
        ]
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::924978846501:role/voclabs"
      + tags_all          = (known after apply)
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # aws_eks_access_policy_association.eks-policy will be created
  + resource "aws_eks_access_policy_association" "eks-policy" {
      + associated_at = (known after apply)
      + cluster_name  = "totem_express-8soat"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::924978846501:role/voclabs"

      + access_scope {
          + type = "cluster"
        }
    }

  # aws_eks_cluster.eks-cluster will be created
  + resource "aws_eks_cluster" "eks-cluster" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "totem_express-8soat"
      + platform_version              = (known after apply)
      + role_arn                      = "arn:aws:iam::992382713563:role/LabRole"
      + status                        = (known after apply)
      + tags_all                      = (known after apply)
      + version                       = (known after apply)

      + access_config {
          + authentication_mode = "API_AND_CONFIG_MAP"
        }

      + kubernetes_network_config (known after apply)

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.node-group will be created
  + resource "aws_eks_node_group" "node-group" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "totem_express-8soat"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t2.micro",
        ]
      + node_group_name        = "totem_express-ng"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::992382713563:role/LabRole"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags_all               = (known after apply)
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 1
          + max_size     = 3
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "totem_express-igw"
        }
      + tags_all = {
          + "Name" = "totem_express-igw"
        }
      + vpc_id   = (known after apply)
    }

  # aws_route_table.rt will be created
  + resource "aws_route_table" "rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name" = "totem_express-rt"
        }
      + tags_all         = {
          + "Name" = "totem_express-rt"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.rt-assiciation[0] will be created
  + resource "aws_route_table_association" "rt-assiciation" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.rt-assiciation[1] will be created
  + resource "aws_route_table_association" "rt-assiciation" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.db_sg will be destroyed
  - resource "aws_security_group" "db_sg" {
      - arn                    = "arn:aws:ec2:us-east-1:992382713563:security-group/sg-03f7e989bbf6d7e3a" -> null
      - description            = "Allow access to RDS instance" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - id                     = "sg-03f7e989bbf6d7e3a" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.0.0.0/16",
                ]
              - from_port        = 3306
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 3306
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - name                   = "totex-express-db-sg" -> null
      - owner_id               = "992382713563" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "totex-express-db-sg"
        } -> null
      - tags_all               = {
          - "Name" = "totex-express-db-sg"
        } -> null
      - vpc_id                 = "vpc-0bf01b4692d2af782" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_security_group.ssh_cluster will be created
  + resource "aws_security_group" "ssh_cluster" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "name" = "totem_express-sg"
        }
      + tags_all               = {
          + "name" = "totem_express-sg"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.subnets[0] will be created
  + resource "aws_subnet" "subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "totem_express-subnet-0"
        }
      + tags_all                                       = {
          + "Name" = "totem_express-subnet-0"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.subnets[1] will be created
  + resource "aws_subnet" "subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "totem_express-subnet-1"
        }
      + tags_all                                       = {
          + "Name" = "totem_express-subnet-1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.totem_express_db_subnet[0] will be destroyed
  - resource "aws_subnet" "totem_express_db_subnet" {
      - arn                                            = "arn:aws:ec2:us-east-1:992382713563:subnet/subnet-050eb2566d2327142" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1a" -> null
      - availability_zone_id                           = "use1-az1" -> null
      - cidr_block                                     = "10.0.0.0/18" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-050eb2566d2327142" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "992382713563" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Application" = "totem-express"
          - "Name"        = "totem-express-subnet-0"
        } -> null
      - tags_all                                       = {
          - "Application" = "totem-express"
          - "Name"        = "totem-express-subnet-0"
        } -> null
      - vpc_id                                         = "vpc-0bf01b4692d2af782" -> null
        # (4 unchanged attributes hidden)
    }

  # aws_subnet.totem_express_db_subnet[1] will be destroyed
  - resource "aws_subnet" "totem_express_db_subnet" {
      - arn                                            = "arn:aws:ec2:us-east-1:992382713563:subnet/subnet-0f1e5f837057ce915" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1b" -> null
      - availability_zone_id                           = "use1-az2" -> null
      - cidr_block                                     = "10.0.64.0/18" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0f1e5f837057ce915" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "992382713563" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Application" = "totem-express"
          - "Name"        = "totem-express-subnet-1"
        } -> null
      - tags_all                                       = {
          - "Application" = "totem-express"
          - "Name"        = "totem-express-subnet-1"
        } -> null
      - vpc_id                                         = "vpc-0bf01b4692d2af782" -> null
        # (4 unchanged attributes hidden)
    }

  # aws_vpc.totem_express_db_vpc will be destroyed
  - resource "aws_vpc" "totem_express_db_vpc" {
      - arn                                  = "arn:aws:ec2:us-east-1:992382713563:vpc/vpc-0bf01b4692d2af782" -> null
      - assign_generated_ipv6_cidr_block     = false -> null
      - cidr_block                           = "10.0.0.0/16" -> null
      - default_network_acl_id               = "acl-0a8b7aad84b338a41" -> null
      - default_route_table_id               = "rtb-01829e8d4e6bfa2b9" -> null
      - default_security_group_id            = "sg-0fe39a7030c860357" -> null
      - dhcp_options_id                      = "dopt-07a1cc07644e139a9" -> null
      - enable_dns_hostnames                 = false -> null
      - enable_dns_support                   = true -> null
      - enable_network_address_usage_metrics = false -> null
      - id                                   = "vpc-0bf01b4692d2af782" -> null
      - instance_tenancy                     = "default" -> null
      - ipv6_netmask_length                  = 0 -> null
      - main_route_table_id                  = "rtb-01829e8d4e6bfa2b9" -> null
      - owner_id                             = "992382713563" -> null
      - tags                                 = {} -> null
      - tags_all                             = {} -> null
        # (4 unchanged attributes hidden)
    }

  # aws_vpc.vpc will be created
  + resource "aws_vpc" "vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "totem_express-vpc"
        }
      + tags_all                             = {
          + "Name" = "totem_express-vpc"
        }
    }

Plan: 13 to add, 0 to change, 5 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @JoaoHL, Action: `pull_request`*